// 요약 정리 퀴즈

//조건문
조건문은 ()로 시작한다
조건문의 조건을 정의할때 조건에 대한 결과값이 ()형으로 판단돼야한다.
조건문 else는 앞의 조건문이 거짓일때 실행()
조건문 else에 따로 정의할 수 ().
조건문 if이후 따로 조건을 정의하려면 ()를 써야한다.
조건문 if와 else의 조건이 같다면 ()안에 있는 조건문 로직이 실행된다.
조건문 if는 조건이 항상 참이므로 어떠한 값이 와도 조건문을 ()한다.

//반복문 
반복문에는 for, (while / within), do-while이 있다.
반복문 초기식, 조건식, 증감식에 따라 반복문 횟수가 결정()
반복문 for는 조건식에 부합하지 않아도 한 번은 무조건 실행()
반복문 do-while은 조건식에 부합하지 않아도 한 번은 무조건 실행()
반복문 내부에 조건문을 정의할 수 ()
한 개 이상의 반복문을 중첩하여 쓸 수 ()
반복문의 키워드는 continue와 (break / stop)이다.
반복문 키워드 continue는 현재 실행하고 있는 반복문을 종료().